public/autobiography/middle-school.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="chronological.html">Chronological</a> &gt;
</p>

<div id="outline-container-orga7da74d" class="outline-2">
<h2 id="orga7da74d">Middle School</h2>
<div class="outline-text-2" id="text-orga7da74d">
<p>
After a family trip in northern Italy I remember I was curious about
"how do people make computer programs", so I asked my dad, which is
not an expert, but he hinted that they were made with programming
languages "like C++". When I came back home I started looking what was
this "c++".  I downloaded dev-c++ and began writing classic programs
like text based games with decision trees. I <a href="old-programs-cpp.html">still have many of those</a>.
</p>

<p>
When I was about 13 I began watching youtube videos on <a href="https://youtu.be/6AZmhj82W-8?si=AkQrqeGK4nUhTl6F">how to make
videogames with Unity</a> engine and I made my own little horror
games. I remember spending most of my wake time watching these videos,
programming in C# and playing either minecraft of The Sims 1.
</p>

<p>
During that time I wanted to <a href="../stash/youtube.html">make youtube videos myself</a> so I started a
<a href="https://www.youtube.com/@San7oS">gaming channel</a> where I would play minecraft and other games. This was
a long yourney: I learned things like redstone, video editing and
recording, photoshop and much more. I was really invested in my
minecraft world and I remember this period as an happy one.
</p>

<p>
I also started playing the <a href="../stash/piano.html">piano</a>! Now it was time for me to go to <a href="high-school.html">high
school</a>.
</p>

<hr />

<p>
&gt; <a href="early-life.html">Early Life</a> &gt; Middle School &gt; <a href="high-school.html">High School 1</a> &gt; <a href="high-school-2.html">High School 2</a> &gt; <a href="university.html">University</a> - &#x2026;
</p>
</div>
</div>
</div>
</body>
</html>
